#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.gcp_resource.data.google_client_config.provider: Reading...
module.gcp_resource.data.google_container_cluster.my_cluster: Reading...
module.gcp_resource.data.google_client_config.provider: Read complete after 0s [id=projects/"off-net-dev"/regions/"northamerica-northeast1"/zones/<null>]
module.gcp_resource.google_container_cluster.my_cluster: Refreshing state... [id=projects/off-net-dev/locations/northamerica-northeast1/clusters/java-rest-app]
module.gcp_resource.data.google_container_cluster.my_cluster: Read complete after 6s [id=projects/off-net-dev/locations/northamerica-northeast1/clusters/java-rest-app]
module.gcp_resource.kubernetes_namespace.env: Refreshing state... [id=namespace-development]
module.gcp_resource.kubernetes_deployment.deployment: Refreshing state... [id=namespace-development/java-rest-app-dev]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.gcp_resource.kubernetes_deployment.deployment will be updated in-place
  ~ resource "kubernetes_deployment" "deployment" {
        id               = "namespace-development/java-rest-app-dev"
        # (1 unchanged attribute hidden)

      ~ metadata {
          ~ annotations      = {
              - "autopilot.gke.io/resource-adjustment" = jsonencode(
                    {
                      - input    = {
                          - containers = [
                              - {
                                  - name = "spring-boot-rest-app"
                                },
                            ]
                        }
                      - modified = true
                      - output   = {
                          - containers = [
                              - {
                                  - limits   = {
                                      - ephemeral-storage = "1Gi"
                                    }
                                  - name     = "spring-boot-rest-app"
                                  - requests = {
                                      - cpu               = "500m"
                                      - ephemeral-storage = "1Gi"
                                      - memory            = "2Gi"
                                    }
                                },
                            ]
                        }
                    }
                ) -> null
              - "autopilot.gke.io/warden-version"      = "31.23.0-gke.9" -> null
            }
            name             = "java-rest-app-dev"
            # (6 unchanged attributes hidden)
        }

      ~ spec {
            # (5 unchanged attributes hidden)

          ~ template {
              ~ spec {
                    # (18 unchanged attributes hidden)

                  ~ container {
                      ~ image                      = "northamerica-northeast1-docker.pkg.dev/off-net-dev/lendly-demo/spring-boot-rest-app:latest" -> "northamerica-northeast1-docker.pkg.dev/off-net-dev/lendly-demo/spring-boot-rest-app:"
                        name                       = "spring-boot-rest-app"
                        # (9 unchanged attributes hidden)

                      - security_context {
                          - allow_privilege_escalation = false -> null
                          - privileged                 = false -> null
                          - read_only_root_filesystem  = false -> null
                          - run_as_non_root            = false -> null
                            # (2 unchanged attributes hidden)

                          - capabilities {
                              - add  = [] -> null
                              - drop = [
                                  - "NET_RAW",
                                ] -> null
                            }
                        }

                        # (1 unchanged block hidden)
                    }

                  - security_context {
                      - run_as_non_root        = false -> null
                      - supplemental_groups    = [] -> null
                        # (4 unchanged attributes hidden)

                      - seccomp_profile {
                          - type              = "RuntimeDefault" -> null
                            # (1 unchanged attribute hidden)
                        }
                    }

                  - toleration {
                      - effect             = "NoSchedule" -> null
                      - key                = "kubernetes.io/arch" -> null
                      - operator           = "Equal" -> null
                      - value              = "amd64" -> null
                        # (1 unchanged attribute hidden)
                    }
                }

                # (1 unchanged block hidden)
            }

            # (2 unchanged blocks hidden)
        }
    }

  # module.gcp_resource.kubernetes_horizontal_pod_autoscaler_v2.java_rest_app_hpa will be created
  + resource "kubernetes_horizontal_pod_autoscaler_v2" "java_rest_app_hpa" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "app" = "java-rest-app-dev"
            }
          + name             = "java-rest-app-hpa-dev"
          + namespace        = "namespace-development"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + max_replicas                      = 3
          + min_replicas                      = 1
          + target_cpu_utilization_percentage = (known after apply)

          + behavior (known after apply)

          + metric {
              + type = "Resource"

              + resource {
                  + name = "cpu"

                  + target {
                      + average_utilization = 80
                      + type                = "Utilization"
                    }
                }
            }

          + scale_target_ref {
              + api_version = "apps/v1"
              + kind        = "Deployment"
              + name        = "java-rest-app-dev"
            }
        }
    }

  # module.gcp_resource.kubernetes_service.dev_service will be created
  + resource "kubernetes_service" "dev_service" {
      + id                     = (known after apply)
      + status                 = (known after apply)
      + wait_for_load_balancer = true

      + metadata {
          + generation       = (known after apply)
          + name             = "dev-service"
          + namespace        = "namespace-development"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + allocate_load_balancer_node_ports = true
          + cluster_ip                        = (known after apply)
          + cluster_ips                       = (known after apply)
          + external_traffic_policy           = (known after apply)
          + health_check_node_port            = (known after apply)
          + internal_traffic_policy           = (known after apply)
          + ip_families                       = (known after apply)
          + ip_family_policy                  = (known after apply)
          + publish_not_ready_addresses       = false
          + selector                          = {
              + "app" = "java-rest-app-dev"
            }
          + session_affinity                  = "None"
          + type                              = "LoadBalancer"

          + port {
              + node_port   = (known after apply)
              + port        = 80
              + protocol    = "TCP"
              + target_port = "8080"
            }

          + session_affinity_config (known after apply)
        }
    }

Plan: 2 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @lendly-telus-com, Action: `pull_request`*